box/app/controllers/box_users_controller.rb

SELECT  "box_users".* FROM "box_users" WHERE "box_users"."id" = ? AND "box_users"."client_index" = ?  ORDER BY "box_users"."id" ASC LIMIT 1  [["id", 3], ["client_index", "eiQBSClBlXwiB6sJXcFilriqZOPTuahTVqMG3GS1sgXtiwpxwOFzqn_0hj0oQ-AFyZdrytqQptbzt8ssM0nVYg"]]
---
  def manage
    @box_user = BoxUser.where(:id => params[:id], :client_index => session[:client_index]).first

SELECT  "box_users".* FROM "box_users" WHERE "box_users"."id" = ? AND "box_users"."client_index" = ?  ORDER BY "box_users"."id" ASC LIMIT 1  [["id", 13], ["client_index", "JY9jld0BJEFmW-jKRb_pMDpXb7J3rFLhNn-eT7cwrjaVJj2atVNt29OlOIXa5h3zacY71iULNQBh4krsaaoWQg"]]
UPDATE "box_users" SET "access_token" = ?, "updated_at" = ? WHERE "box_users"."id" = ?  [["access_token", "g65Q3MG230O0jzq36ZiRo5xtTXWWMJQU"], ["updated_at", "2016-02-10 00:13:37.830294"], ["id", 1]]
---
  def oauth_validate
    if validate_security_token
      @box_user = BoxUser.where(:id => params[:id], :client_index => params[:state]).first #
      @box_user.request_access_token params[:code]
      @box_user.save

INSERT INTO "box_users" ("client_id", "client_secret", "client_index", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["client_id", "cat"], ["client_secret", "dog"], ["client_index", "pohfdwgu"], ["created_at", "2016-02-09 04:06:31.560312"], ["updated_at", "2016-02-09 04:06:31.560312"]]
---
  def create
    @box_user = BoxUser.new(box_user_params)
    @box_user.client_index = SecureRandom.urlsafe_base64(n=64, padding=false) # should me moved to BoxUser model
    respond_to do |format|
      if @box_user.save

SELECT  "box_users".* FROM "box_users" WHERE "box_users"."id" = ? AND "box_users"."client_index" = ?  ORDER BY "box_users"."id" ASC LIMIT 1  [["id", 1], ["client_index", "WpiE6GYDaRtFUmCGc1TcxMPBa7le10SXNN7misWGFXRskBBNOhEBNm_gRNfHH6uCtivzs8VmpZvbnwjU5EKDWA"]]
DELETE FROM "box_users" WHERE "box_users"."id" = ?  [["id", 1]]
---
  def destroy
    @box_user = BoxUser.where(:id => params[:id], :client_index => session[:client_index]).first # should be moved to BoxUserModel
    if @box_user.nil?
      reset_session
      redirect_to action: "index"
    else
      @box_user.destroy

SELECT  "box_users".* FROM "box_users" WHERE "box_users"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_box_user
      @box_user = BoxUser.find(params[:id])